doc/manual.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Taf Language Specification</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-13 11:45:04 CET"/>
<meta name="author" content="Manuel Simoni"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="stylesheet.css"/>
</head>
<body>
<div id="content">

<h1 class="title">Taf Language Specification</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Description </a></li>
<li><a href="#sec-2">Core </a>
<ul>
<li><a href="#sec-2.1">let* [special] </a></li>
<li><a href="#sec-2.2">letrec [special] </a></li>
<li><a href="#sec-2.3">lambda [special] </a></li>
<li><a href="#sec-2.4">define &lt;name&gt; &lt;value&gt; -&gt; #void [special] </a></li>
<li><a href="#sec-2.5">define-macro (&lt;name&gt; . &lt;parameters&gt;) . &lt;body&gt; [special] </a></li>
<li><a href="#sec-2.6">begin [special] </a></li>
<li><a href="#sec-2.7">if &lt;test&gt; &lt;then&gt; &lt;else&gt; -&gt; &lt;result&gt; [special] </a></li>
<li><a href="#sec-2.8">loop . &lt;body&gt; -&gt; #void [special] </a></li>
<li><a href="#sec-2.9">block [special] </a></li>
<li><a href="#sec-2.10">return-from [special] </a></li>
<li><a href="#sec-2.11">unwind-protect [special] </a></li>
<li><a href="#sec-2.12">push-prompt [special] </a></li>
<li><a href="#sec-2.13">take-subcont [special] </a></li>
<li><a href="#sec-2.14">push-subcont [special] </a></li>
</ul>
</li>
<li><a href="#sec-3">Translating to MLPolyR </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Description </h2>
<div class="outline-text-2" id="text-1">


<p>
<i>Taf</i> is an experimental dialect of Lisp aiming at a tractable
implementation of three expressive constructs: hygienic macros for
syntax abstraction, delimited continuations for control abstraction,
and row polymorphism for value abstraction.
</p>
<p>
Taf has a ML-like strict core, but without partial application (IOW,
functions are always applied to all arguments at once).  The only data
types are primitives, such as numbers, and polymorphic variants with
labelled fields (i.e. every such user-defined variant has as body a
polymorphic record containing slots).
</p>
<p>
Taf's goal is to enable programming in Common Lisp style with open
generic functions while offering static type checking.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Core </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1">let* [special] </h3>
<div class="outline-text-3" id="text-2.1">


<p>
Scheme's `let*'.
</p>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2">letrec [special] </h3>
<div class="outline-text-3" id="text-2.2">


<p>
Scheme's `letrec', but allowing only anonymous procedures on the
right-hand side.
</p>
</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3">lambda [special] </h3>
<div class="outline-text-3" id="text-2.3">


<p>
Scheme's `lambda', but without a rest parameter.
</p>
</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4">define &lt;name&gt; &lt;value&gt; -&gt; #void [special] </h3>
<div class="outline-text-3" id="text-2.4">


<p>
Scheme's `define', but allowed only at the top-level.
</p>
</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5">define-macro (&lt;name&gt; . &lt;parameters&gt;) . &lt;body&gt; [special] </h3>
<div class="outline-text-3" id="text-2.5">


<p>
Similar to Common Lisp's `defmacro', but without quote or backquote.
Code needs to be constructed with `cons', `list', etc.  Instead of
referring to global bindings via quoted symbols, their values are
directly referred to in the constructed expressions.
</p>
</div>

</div>

<div id="outline-container-2.6" class="outline-3">
<h3 id="sec-2.6">begin [special] </h3>
<div class="outline-text-3" id="text-2.6">


<p>
Scheme's `begin'.
</p>
<p>
As in Scheme, the contents of `begin' forms at the top-level are
considered to be at the top-level themselves, recursively.
</p>
</div>

</div>

<div id="outline-container-2.7" class="outline-3">
<h3 id="sec-2.7">if &lt;test&gt; &lt;then&gt; &lt;else&gt; -&gt; &lt;result&gt; [special] </h3>
<div class="outline-text-3" id="text-2.7">


</div>

</div>

<div id="outline-container-2.8" class="outline-3">
<h3 id="sec-2.8">loop . &lt;body&gt; -&gt; #void [special] </h3>
<div class="outline-text-3" id="text-2.8">


</div>

</div>

<div id="outline-container-2.9" class="outline-3">
<h3 id="sec-2.9">block [special] </h3>
<div class="outline-text-3" id="text-2.9">


</div>

</div>

<div id="outline-container-2.10" class="outline-3">
<h3 id="sec-2.10">return-from [special] </h3>
<div class="outline-text-3" id="text-2.10">


</div>

</div>

<div id="outline-container-2.11" class="outline-3">
<h3 id="sec-2.11">unwind-protect [special] </h3>
<div class="outline-text-3" id="text-2.11">


</div>

</div>

<div id="outline-container-2.12" class="outline-3">
<h3 id="sec-2.12">push-prompt [special] </h3>
<div class="outline-text-3" id="text-2.12">


</div>

</div>

<div id="outline-container-2.13" class="outline-3">
<h3 id="sec-2.13">take-subcont [special] </h3>
<div class="outline-text-3" id="text-2.13">


</div>

</div>

<div id="outline-container-2.14" class="outline-3">
<h3 id="sec-2.14">push-subcont [special] </h3>
<div class="outline-text-3" id="text-2.14">


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Translating to MLPolyR </h2>
<div class="outline-text-2" id="text-3">


<p>
For typechecking, Taf code is translated to MLPolyR code.
</p>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Manuel Simoni
<a href="mailto:msimoni@gmail.com">&lt;msimoni@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2013-01-13 11:45:04 CET</p>
</div>
</div>
</body>
</html>
